{"Language": "en_us", "Programming Language": "Python", "Original Requirements": "build a LLM powered virtual casting agency that performs screenplay analysis to augment our production pipeline, extracting insightful character, location, scene and dialogue reports as well as other screenplay analysis information. note: this is internal tool, so no need for competitive analysis or planning for external customers. we are using it to augment our process to provide AWS Polly voice casting for our screenplay projects. client information:\n- name: Khaos Studio\n- about: animation studio focused on excellence in storytelling. internal software team develops platform and tools to automate animation tasks for studio. prefers open LLMs (llama2,mistral, mixtral, etc) instead of private models like OpenAI. makes heavy use of LMStudio and Ollama in-house. existing solutions:\n    - screenplay ingestion process that parses the screenplay into structured JSON data\n        - Lambda backed API's accept POST request containing .fountain text in body or FDX file (FDX is converted to .fountain format, fountain file is parsed to JSON)\n            - the Fountain is plain text and parsed data is JSON containing structured data about the screenplay\n            - example parsed JSON: https://khaos-screenplayer-demospace.s3.us-west-2.amazonaws.com/pulp-fiction/screenplay/screenplay.json\n            - example fountain text: https://khaos-screenplayer-demospace.s3.us-west-2.amazonaws.com/pulp-fiction/screenplay/screenplay.fountain\n    - established schema for screenplay data ( see examples provided )\n    - S3 base solution for storing the screenplay project data\n    - service for producing the audio clips for dialogue and narration elements using AWS Polly\nneeds:\n    - voice casting based on screenplay data\n    - dialogue and narration analysis for realistic generation via SSML metadata\nother related solutions:\n- metaGPT\n- Autogen\n- LiteLLM\n- vLLM", "Project Name": "virtual_casting_agency", "Product Goals": ["Create a LLM powered virtual casting agency.", "Provide insightful screenplay analysis reports.", "Augment the production pipeline with voice casting using AWS Polly."], "User Stories": ["As an internal tool user, I want to extract character and location data for my screenplay project.", "As a screenwriter, I need a tool that can analyze dialogue and provide realistic generation options through SSML metadata."], "Competitive Analysis": [], "Competitive Quadrant Chart": "", "Requirement Analysis": "The virtual casting agency should be powered by LLM technology for efficient voice casting and screenplay analysis.", "Requirement Pool": [["P0", "Implement a LLM-based virtual casting system for voice casting."], ["P1", "Provide insightful character, location, scene, and dialogue reports based on screenplay analysis."]], "UI Design draft": "The UI should be user-friendly and provide a simple interface for extracting required information from screenplays.", "Anything UNCLEAR": "None"}